package collection;
public class Collectoin_1101 {

	public static void main(String[] args) {
		/*
		 * 컬렉션(Collection)
		 * 		- 자바에서 제공하는 자료구조를 담당하는 프레임워크 이다.
		 * 		- 배열에 데이터를 담아 관리하는 방법에서 자료구조를 적용하여
		 * 		  좀 더 효율적으로 데이터를 관리할 수 있도록 다양한 기능을 제공한다.
		 * 		- 구현된 자료구조 종류에 따라 List, Set, Map 등으로 분류하여 제공한다.
		 * 
		 * 
		 * 배열 vs 컬렉션 (사용자 입장 = 나)
		 * 		배열 특징
		 * 			- 한 번 크기를 정하면 변경할 수 없다.
		 * 			- 배열에 저장된 데이터의 추가/수정/삭제 과정이 불편하다. 
		 * 			- 한 가지 타입에 대해서만 저장할 수 있다.(다형성 사용하면 여러타입 저장 가능하다.)
		 * 
		 * 		컬렉션 특징
		 * 			- 언제든 크기를 늘리거나 줄일 수 있다.
		 * 			- 컬렉션에 저장된 데이터의 추가/수정/삭제 등의 과정은
		 * 			  기본 제공하는 메서드에 의해 처리가 이루어진다.
		 * 			- 여러 타입에 대한 데이터 저장이 가능하다.
		 */

	}

}